---
type: AssemblyMemberDifferentType
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# AssemblyMemberDifferentType

`Autodesk.Revit.DB.AssemblyMemberDifferentType` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | TypeId1 | 2012 | `public ElementId TypeId1 { get ; }` |
| Property | TypeId2 | 2012 | `public ElementId TypeId2 { get ; }` |